# Метод __repr__ в Python выдает текстовое или строковое представление сущности или объекта.
# Этот процесс вызывается всякий раз при вызове метода repr() для какой-то сущности.
# Можно сказать, что методы repr() и __repr__ взаимозаменяемы.
#
# Функция __str__ в Python делает то же самое, но ее поведение всё же немного отличается.
# Она предназначена для создания удобочитаемой версии, полезной для отслеживания или отображения информации об объекте.
# А метод __repr__ предназначен для предоставления «официального» текстового образа объекта,
# который можно использовать для воссоздания этого объекта.
